#include <stdio.h>
#include <stdlib.h>
#include <float.h>
#include <math.h>
extern double best_match(double *query, double *serie, int lenQ, int lenS);
double _dtw(double *query, double *serie, int lenQ, int lenS);
double dtw(double *query, double *serie, int lenQ, int lenS);

int main() {
    double Q[] = {-0.25373510416577844, 0.38781041115987297, 0.4045439025077193, -2.020343869416486, 1.8629996631859438, 0.8149545494681946, -0.040259340245858, -0.7087571462896328, 0.20851957842398847, -0.39606977847883096, -1.8342341994453129, -1.1500694092968318, -0.11983438251612771, 0.5215274380000354, -0.5956675346597748, 0.2946975222075675, 0.05188572390748707, 0.2929271632000897, 2.417936113148316, 0.9974913365645868};
    double S[] = {-0.3515683757812146, 0.8124537741162213, 0.41374599309253407, 1.0251791289399141, 0.02683504272066759, 2.26668452360189, 2.7936766027117694, -0.6494514676287985, 1.260493994175607, 1.5610621513194791, 0.6538179068682594, -0.1786117998839538, -1.7331674040404346, -0.8766362727278937, 0.9402710716582785, -0.7242529990140583, 1.1675051819715403, -0.6579094978467579, -0.6792894220891443, -0.370191805572341};
    // double Q[] = {2, 3, 4};
    // double S[] = {4, 2, 3, 4, 5, 5, 5, 5};

    int lenQ = sizeof(Q) / sizeof(Q[0]);
    int lenS = sizeof(S) / sizeof(S[0]);

    // 找到最佳匹配的子序列
    printf("\nlen(query) %d", lenQ);
    printf("\n[dtw] %lf", dtw(Q, S, lenQ, lenS));
    printf("\n[best_match] %lf\n", best_match(Q, S, lenQ, lenS));
    // printf("\n[Match Value] %lf\n", best_match(Q, S, lenQ, lenS));

    return 0;
}
 